---
kind: method
id: M:Autodesk.Revit.DB.ScheduleField.GetName
source: html/33d57eac-bbf6-1852-ea11-7e99b0ffbbff.htm
---
# Autodesk.Revit.DB.ScheduleField.GetName Method

Gets the name of the field.

## Syntax (C#)
```csharp
public string GetName()
```

## Returns
The name of the field.